app/Models/ModelProfil.php

SELECT *
FROM `admin`
WHERE `admin_id` = 1
---
    public function DetailData()
    {
        return $this->db->table('admin')
            ->where('admin_id', 1)
            ->get()->getRowArray();