app/Models/ModelPerusahaan.php

SELECT *
FROM `perusahaan`
WHERE `perusahaan_id` = 1
---
    public function DetailData()
    {
        return $this->db->table('perusahaan')
            ->where('perusahaan_id', 1)
            ->get()->getRowArray();

UPDATE `perusahaan` SET `perusahaan_id` = 1, `logo` = 'logo.png', `logo_header` = 'kreasilogo.png', `nama_perusahaan` = 'Kreasi AI', `alamat_perusahaan` = 'Jl. aja dulu, sukses, belakangan', `tentang_kami` = NULL
WHERE `perusahaan_id` = 1
---
    public function UpdateData($data)
    {
        $this->db->table('perusahaan')
            ->where('perusahaan_id', $data['perusahaan_id'])
            ->update($data);