app/Models/ModelAuth.php

SELECT *
FROM `admin`
WHERE `username` = 'shofiudin_wafa'
---
    public function getData($username)
    {
        return $this->db->table('admin')
            ->where('username', $username)
            ->get()->getRowArray();