app/Models/ModelLayanan.php

    public function AllData()
    {
        return $this->db->table('layanan')
            ->get()->getResultArray();
---
SELECT *
FROM `layanan`

    public function DaftarLayanan($slug_nama)
    {
        return $this->db->table('layanan')
            ->where(['slug_nama' => $slug_nama])
            ->get()->getRowArray();
---
SELECT *
FROM `layanan`
WHERE `slug_nama` = 'website'

    public function getPaket($slug_nama)
    {
        return $this->db->table('paketlayanan')
            ->join('layanan', 'layanan.layanan_id=paketlayanan.layanan_id')->where(['slug_nama' => $slug_nama])->get()
            ->getResultArray();
---
SELECT *
FROM `paketlayanan`
JOIN `layanan` ON `layanan`.`layanan_id`=`paketlayanan`.`layanan_id`
WHERE `slug_nama` = 'website'

    public function SavePaket($data)
    {
        $this->db->table('paketlayanan')->insert($data);
---
INSERT INTO `paketlayanan` (`layanan_id`, `nama_paket`, `harga_paket`, `potongan_paket`, `detail_paket`) VALUES ('1', 'rame-rame', '1000000', 0, '<p>sdfsdfsf</p><p><strike>sdfsdfsd</strike></p><p>sdfsdfsdf</p><p>sdfdsfd<br><br></p>')